<?php

namespace Database\Seeders;

use App\Models\Zodiac;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class ZodiacSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        $zodiacs = [
            [
                'name' => "Aries",
                'period' => "Mar 21 - Apr 19",
                "desc" => "Ariesတွေအနေနဲ့ ရဲရင့်တယ်၊ စွန့်စားလိုစိတ်ရှိတယ်။ လူတွေကိုလည်းခေါင်းဆောင်နိုင်တဲ့ အရည်အသွေးတွေရှိနေပါတယ်။ ဒါပေမယ့် တစ်ခါတလေမှာတော့ အတ္တကြီးပြီး စိတ်မရှည်တတ်ပါဘူး။"
                // 'image' => asset('imgs/signs/aries.png')
            ],
            [
                'name' => "Taurus",
                'period' => "Apr 20 - May 20",
                "desc" => "Taurusတွေက သည်းခံတတ်တယ်။ ဘယ်လိုမျိုးကိစ္စတွေမှာမဆို သူတိုကိုယုံကြည်စိတ်ချရတယ်။ တနည်းအားဖြင့် သစ္စာရှိတယ်။ ဒါပေမယ့် ပိုင်ဆိုင်လိုစိတ်ကြီးတာ၊ ကိုယ့်ကို နာကျင်အောင်လုပ်ရင် လက်တုံပြန်ချင်တဲ့စိတ်ရှိပါတယ်။"
                // 'image' => asset('imgs/signs/tarius.png')
            ],
            [
                'name' => "Gemini",
                'period' => "May 21 - Jun 20",
                "desc" => "Geminiတွေက လိုက်လျောညီထွေဖြစ်အောင်နေတတ်တယ်။ အပြောအဆို ဆက်ဆံရေးကောင်းမွန်ခြင်း၊ ဉာဏ်ကောင်းခြင်းတိုကြောင့် လူချစ်လူခင်များပါတယ်။ တစ်ခါတလေမှာ စိတ်တည်ငြိမ်မှုမရှိဘဲ တချိုလူတွေကိုလည်း အပေါ်ယံလောက်ပဲ ဆက်ဆံမိတတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/gemini.png')
            ],
            [
                'name' => "Cancer",
                'period' => "Jun 21 - Jul 22",
                "desc" => "Cancerတွေကတော့ စိတ်ခံစားလွယ်တဲ့သူတွေဖြစ်ပြီး တခြားလူတွေကို သေချာဂရုစိုက်ပေးတတ်ပါတယ်။ ချစ်ခြင်းမေတ္တာကြီးမားပြီးတော့ သူတိုသဘောကျ၊မြတ်နိုးတဲ့သူတိုင်းကို တန်ဖိုးထားတတ်ပါတယ်။ တစ်ခါတလေမှာ စိတ်ဆိုးလွယ်ပေမယ့် အတိတ်ကို မမေ့နိုင်ပါဘူး။"
                // 'image' => asset('imgs/signs/cancer.png')
            ],
            [
                'name' => "Leo",
                'period' => "Jul 23 - Aug 22",
                "desc" => "Leoတွေကတော့ရက်ရောတယ်၊ သူများတွေကို စိတ်တက်ကြွအောင် လုပ်ပေးနိုင်သလို ကိုယ်တိုင်လည်း စိတ်အားထက်သန်ပါတယ်။ ခေါင်းဆောင်နိုင်တဲ့လူမျိုးပါ။ ဒါပေမယ့် အဲ့စိတ်ကြောင့်ပဲ တစ်ခါတလေမှာ မာနကြီးပြီး အာဏာရှင်ဆန်တတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/leo.png')
            ],
            [
                'name' => "Virgo",
                'period' => "Aug 23 - Sep 22",
                "desc" => "Virgoတွေက အသေးစိတ်ကို သေချာဂရုစိုက်ပေးတတ်ပါတယ်။ အပြောထပ် အလုပ်ကို ပိုဦးစားပေးပါတယ်။ လက်တွေ့ကျတာကိုပဲ သဘောကျပြီး တစ်ခါတလေမှာ ဝေဖန်လွန်းပြီး လူမှုဆက်ဆံရေးကိစ္စတွေမှာ စိုးရိမ်ပူပန်တတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/virgo.png')
            ],
            [
                'name' => "Libra",
                'period' => "Sep 23 - Oct 23",
                "desc" => "Libraတွေက တရားမျှတတဲ့သဘောရှိသူတွေပါ။ သူတိုက Romantic ဆန်ခြင်း၊ လူမှုဆက်ဆံရေးကောင်းမွန်ခြင်းတိုကြောင့် လူအများကြားထင်ပေါ်နေတတ်ပါတယ်။ တစ်ခါတလေမှာ ဆုံးဖြတ်ချက်မပြတ်သားတတ်ဘဲ သူတိုဘဝလမ်းမှာ သူများတွေရဲ့ ဝင်ရောက်စွက်ဖက်မှုကို ခံရတတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/libre.png')
            ],
            [
                'name' => "Scorpius",
                'period' => "Oct 24 - Nov 21",
                "desc" => "Scorpio တွေအနေနဲ့ ဆုံးဖြတ်ချက်ခိုင်မာတယ်၊စိတ်အားထက်သန်တဲ့အပြင် စူးစမ်းလေ့လာလိုစိတ်ပြင်းထန်တဲ့လူစားမျိုးလည်းဖြစ်ပါတယ်။ တစ်ခါတလေမှာ မနာလိုစိတ်များပြီး အစွဲအလမ်းလည်းကြီးမားပါတယ်။"
                // 'image' => asset('imgs/signs/scorpio.png')
            ],
            [
                'name' => "Sagittarius",
                'period' => "Nov 22 - Dec 21",
                "desc" => "Sagittarius တွေက အကောင်းမြင်စိတ်များတယ်။ လွတ်လပ်မှုကို မြတ်နိုးပြီး ပေါ့ပေါ့ပါးပါး နေရတာကို နှစ်သက်ပါတယ်။ အပေါင်းအသင်းခင်တတ်ပါတယ်။ တစ်ခါတလေမှာ အလွန်အကောင်းမြင်လွန်းပြီး တာဝန်မဲ့သလိုဖြစ်တတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/sagittarius.png')
            ],
            [
                'name' => "Capricornus",
                'period' => "Dec 22 - Jan 19",
                "desc" => "Capricorn တွေရဲ့ ပုံစံကတော့ လက်တွေ့ကျကျလုပ်ဆောင်တတ်တယ်၊ စည်းကမ်းရှိတယ်၊ ပြီးတော့ သည်းခံနိုင်စွမ်းလည်းရှိပါတယ်။ ဒါပေမယ့် တစ်ခါတလေမှာတော့ သူတိုစိတ်ထဲ အဆိုးမြင်တာမျိုးရှိပြီး လောဘကြီးတာမျိုးတွေလည်းဖြစ်တတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/capricorn.png')
            ],
            [
                'name' => "Aquarius",
                'period' => "Jan 20 - Feb 18",
                "desc" => "Aquarius တွေအနေနဲ့က ဖော်ရွေမှုရှိပြီးခင်တတ်မင်တတ်ပါတယ်၊ လူသားချင်းစာနာတတ်ပြီး ကိုယ်ချင်းစာတရား ရှေ့ထားတတ်ပါတယ်။ သူတိုတွေမှာ လွတ်လပ်ခြင်းကို တွေ့ရနိုင်တဲ့အပြင် တစ်ခါတလေမှာ ခန့်မှန်းရခက်ပြီး အထီးကျန်ဆန်နေတတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/aquarius.png')
            ],
            [
                'name' => "Pisces",
                'period' => "Feb 19 - Mar 20",
                "desc" => "Pisces တွေရဲ့ စိတ်နေသဘောထားကိုပြောရမယ်ဆိုရင် စိတ်ကူးယဉ်ဆန်တဲ့ပုံစံမျိုးဖြစ်နေတတ်ပြီး စိတ်ကလည်း ခံစားလွယ်ပါတယ်။ စာနာတတ်ပေမယ့် တစ်ခါတလေမှာ အဲ့စိတ်ကြောင့်ပဲ လွယ်လွယ်ကူကူ သွေးဆောင်ခံရတတ်ပါတယ်။"
                // 'image' => asset('imgs/signs/pisces.png')
            ],
        ];

        foreach ($zodiacs as $zodiac) {
            Zodiac::firstOrCreate([
                'slug' => Str::slug($zodiac['name'])
            ], [
                'slug' => Str::slug($zodiac['name']),
                'name' => $zodiac['name'],
                'period' => $zodiac['period'],
                'desc' => $zodiac['desc'],
            ]);
        }
    }
}
